app/views/lists/index.html.erb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
<% else %>
  <h4>Board Name : <%= @lists.first.board.name %></h4>