app/views/cards/index.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<% else %>
  <h4>List Name : <%= @cards.first.list.name %></h4>