app/controllers/boards_controller.rb

  def create
    #@board= Board.new(board_params)
    @board = current_user.boards.build(board_params)
    if @board.save
---
INSERT INTO "boards" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "DSA"], ["created_at", "2021-10-12 13:18:01.114145"], ["updated_at", "2021-10-12 13:18:01.114145"], ["user_id", 6]]

  def update

    if @board.update(board_params)
---
UPDATE "boards" SET "name" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["name", "DSAA"], ["updated_at", "2021-10-12 13:19:18.727388"], ["id", 10]]

  def destroy
    #@board = Board.find(params[:id])
    @board.destroy
---
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 10]]

  def correct_user
    @board=current_user.boards.find_by(id: params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1 AND "boards"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 10], ["LIMIT", 1]]

  def set_board
    @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]