app/controllers/cards_controller.rb

  def update
    if @card.update(card_params)
---
UPDATE "cards" SET "status" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["status", "k"], ["updated_at", "2021-10-14 09:43:29.729450"], ["id", 24]]

  def destroy
    @card.destroy
---
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 19]]

    def set_card
      @card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

    def get_list
      @list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]