app/controllers/cards_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def new
    @board = Board.find(params[:board_id])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "cards" ("name", "status", "created_at", "updated_at", "list_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dnc"], ["status", "ndcm"], ["created_at", "2021-10-13 12:53:09.948216"], ["updated_at", "2021-10-13 12:53:09.948216"], ["list_id", 9]]
---
  def create
    @board = Board.find(params[:board_id])
    @card = Card.new(card_params)
    @card.list_id = @list.id
    if @card.save

SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def set_card
      @card = Card.find(params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def get_list
      @list = List.find(params[:list_id])