app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at", "board_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hbhdnh"], ["created_at", "2021-10-13 09:50:32.540762"], ["updated_at", "2021-10-13 09:50:32.540762"], ["board_id", 13]]
---
  def create
    @list = List.new(list_params)
    @list.board_id = @board.id
    if @list.save

UPDATE "lists" SET "name" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["name", "abc"], ["updated_at", "2021-10-13 08:06:05.183770"], ["id", 1]]
---
  def update
    if @list.update(list_params)

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 3]]
---
  def destroy
    @list.destroy

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def get_board
      @board = Board.find(params[:board_id])