app/models/user.rb

SELECT "users".* FROM "users" WHERE (lower(username) = 'shaista' OR lower(email) = 'shaista') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def self.find_for_database_authentication warden_condition
  conditions = warden_condition.dup
  login = conditions.delete(:login)
  where(conditions).where(
    ["lower(username) = :value OR lower(email) = :value",
    { value: login.strip.downcase}]).first